title: "Out of standard processus of execution/installation for Teamviewer"
description: "Triggers when Teamviewer is spawned from a non-standard parent process, here we suppose you install Teamviewer from powershell script in your organization,another parent process could indicate suspicious activities. Ideally, it’s recommended to exclude only specific element from the powershell script you use to install Teamviewer on your organization and consider the rest suspicious"
logsource:
    product: EDR
detection:
    selection_normal_parent:
        - ParentImage|endswith:
            #- '\powershell*.exe' #Uncomment depending if you don't have Powershell Script Block
            - '\services.exe'
            - '\explorer.exe'
    selection_process:
        - Image|endswith: 'teamviewer*.exe'
        - signature: 'TeamViewer Germany GmbH'
        - dns_query|endswith: '.teamviewer.com'
    selection_powershell_script:
        - ScriptBlockText|contains: 'Indicate specific element of your powershell script' #Do not put the condition if powershell script is not used for installation
    condition: selection_process and not (selection_normal_parent or selection_powershell_script)
    falsepositives:
        - Out of organization process installation or execution
